thelemon22/regis/demo_projects/dsPIC33E/h/p33Exxxx.h
/*
** generic header file for dsPIC33E
*/
#if defined(__dsPIC33EP128GP502__)

#include <p33EP128GP502.h>

#elif defined(__dsPIC33EP128GP504__)

#include <p33EP128GP504.h>

#elif defined(__dsPIC33EP128GP506__)

#include <p33EP128GP506.h>

#elif defined(__dsPIC33EP128MC202__)

#include <p33EP128MC202.h>

#elif defined(__dsPIC33EP128MC204__)

#include <p33EP128MC204.h>

#elif defined(__dsPIC33EP128MC206__)

#include <p33EP128MC206.h>

#elif defined(__dsPIC33EP128MC502__)

#include <p33EP128MC502.h>

#elif defined(__dsPIC33EP128MC504__)

#include <p33EP128MC504.h>

#elif defined(__dsPIC33EP128MC506__)

#include <p33EP128MC506.h>

#elif defined(__dsPIC33EP256GP502__)

#include <p33EP256GP502.h>

#elif defined(__dsPIC33EP256GP504__)

#include <p33EP256GP504.h>

#elif defined(__dsPIC33EP256GP506__)

#include <p33EP256GP506.h>

#elif defined(__dsPIC33EP256MC202__)

#include <p33EP256MC202.h>

#elif defined(__dsPIC33EP256MC204__)

#include <p33EP256MC204.h>

#elif defined(__dsPIC33EP256MC206__)

#include <p33EP256MC206.h>

#elif defined(__dsPIC33EP256MC502__)

#include <p33EP256MC502.h>

#elif defined(__dsPIC33EP256MC504__)

#include <p33EP256MC504.h>

#elif defined(__dsPIC33EP256MC506__)

#include <p33EP256MC506.h>

#elif defined(__dsPIC33EP256MU806__)

#include <p33EP256MU806.h>

#elif defined(__dsPIC33EP256MU810__)

#include <p33EP256MU810.h>

#elif defined(__dsPIC33EP256MU814__)

#include <p33EP256MU814.h>

#elif defined(__dsPIC33EP32GP502__)

#include <p33EP32GP502.h>

#elif defined(__dsPIC33EP32GP503__)

#include <p33EP32GP503.h>

#elif defined(__dsPIC33EP32GP504__)

#include <p33EP32GP504.h>

#elif defined(__dsPIC33EP32MC202__)

#include <p33EP32MC202.h>

#elif defined(__dsPIC33EP32MC203__)

#include <p33EP32MC203.h>

#elif defined(__dsPIC33EP32MC204__)

#include <p33EP32MC204.h>

#elif defined(__dsPIC33EP32MC502__)

#include <p33EP32MC502.h>

#elif defined(__dsPIC33EP32MC503__)

#include <p33EP32MC503.h>

#elif defined(__dsPIC33EP32MC504__)

#include <p33EP32MC504.h>

#elif defined(__dsPIC33EP512GP806__)

#include <p33EP512GP806.h>

#elif defined(__dsPIC33EP512MC806__)

#include <p33EP512MC806.h>

#elif defined(__dsPIC33EP512MU810__)

#include <p33EP512MU810.h>

#elif defined(__dsPIC33EP512MU814__)

#include <p33EP512MU814.h>

#elif defined(__dsPIC33EP64GP502__)

#include <p33EP64GP502.h>

#elif defined(__dsPIC33EP64GP503__)

#include <p33EP64GP503.h>

#elif defined(__dsPIC33EP64GP504__)

#include <p33EP64GP504.h>

#elif defined(__dsPIC33EP64GP506__)

#include <p33EP64GP506.h>

#elif defined(__dsPIC33EP64MC202__)

#include <p33EP64MC202.h>

#elif defined(__dsPIC33EP64MC203__)

#include <p33EP64MC203.h>

#elif defined(__dsPIC33EP64MC204__)

#include <p33EP64MC204.h>

#elif defined(__dsPIC33EP64MC206__)

#include <p33EP64MC206.h>

#elif defined(__dsPIC33EP64MC502__)

#include <p33EP64MC502.h>

#elif defined(__dsPIC33EP64MC503__)

#include <p33EP64MC503.h>

#elif defined(__dsPIC33EP64MC504__)

#include <p33EP64MC504.h>

#elif defined(__dsPIC33EP64MC506__)

#include <p33EP64MC506.h>

#else

#error -- processor ID not specified in generic header file

#endif
